[Killed] BlockStatement
src/lib/dnd/adapter.ts:4:85
 import { arrayMove } from '@dnd-kit/sortable';
 import { BoardState } from '../../types';
 
-export const findColumnOfTask = (columns: BoardState['columns'], taskId: string) => {
-  return columns.find((col) => col.taskIds.includes(taskId));
-};
+export const findColumnOfTask = (columns: BoardState['columns'], taskId: string) => {};
 
 export const moveTask = (
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ArrowFunction
src/lib/dnd/adapter.ts:5:23
 import { BoardState } from '../../types';
 
 export const findColumnOfTask = (columns: BoardState['columns'], taskId: string) => {
-  return columns.find((col) => col.taskIds.includes(taskId));
+  return columns.find(() => undefined);
 };
 
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run



 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ArrowFunction
src/lib/dnd/adapter.ts:14:41
   overId: string
 ): BoardState => {
   const activeColumn = findColumnOfTask(state.columns, activeId);
-  const overColumn = state.columns.find((col) => col.id === overId) || findColumnOfTask(state.columns, overId);
+  const overColumn = state.columns.find(() => undefined) || findColumnOfTask(state.columns, overId);
 
   if (!activeColumn || !overColumn) return state;
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ConditionalExpression
src/lib/dnd/adapter.ts:14:22
   overId: string
 ): BoardState => {
   const activeColumn = findColumnOfTask(state.columns, activeId);
-  const overColumn = state.columns.find((col) => col.id === overId) || findColumnOfTask(state.columns, overId);
+  const overColumn = true;
 
   if (!activeColumn || !overColumn) return state;
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] BooleanLiteral
src/lib/dnd/adapter.ts:16:24
   const activeColumn = findColumnOfTask(state.columns, activeId);
   const overColumn = state.columns.find((col) => col.id === overId) || findColumnOfTask(state.columns, overId);
 
-  if (!activeColumn || !overColumn) return state;
+  if (!activeColumn || overColumn) return state;
 
   const activeIndex = activeColumn.taskIds.indexOf(activeId);
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ConditionalExpression
src/lib/dnd/adapter.ts:16:7
   const activeColumn = findColumnOfTask(state.columns, activeId);
   const overColumn = state.columns.find((col) => col.id === overId) || findColumnOfTask(state.columns, overId);
 
-  if (!activeColumn || !overColumn) return state;
+  if (true) return state;
 
   const activeIndex = activeColumn.taskIds.indexOf(activeId);
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ConditionalExpression
src/lib/dnd/adapter.ts:22:9
   const overIndex = overColumn.taskIds.indexOf(overId);
 
   const newColumns = state.columns.map((col) => {
-    if (col.id === activeColumn.id && col.id === overColumn.id) {
+    if (true) {
       return {
         ...col,
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ConditionalExpression
src/lib/dnd/adapter.ts:22:9
   const overIndex = overColumn.taskIds.indexOf(overId);
 
   const newColumns = state.columns.map((col) => {
-    if (col.id === activeColumn.id && col.id === overColumn.id) {
+    if (true && col.id === overColumn.id) {
       return {
         ...col,
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ConditionalExpression
src/lib/dnd/adapter.ts:29:9
       };
     }
 
-    if (col.id === activeColumn.id) {
+    if (true) {
       return {
         ...col,
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] EqualityOperator
src/lib/dnd/adapter.ts:29:9
       };
     }
 
-    if (col.id === activeColumn.id) {
+    if (col.id !== activeColumn.id) {
       return {
         ...col,
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ObjectLiteral
src/lib/dnd/adapter.ts:30:14
     }
 
     if (col.id === activeColumn.id) {
-      return {
-        ...col,
-        taskIds: col.taskIds.filter((id) => id !== activeId),
-      };
+      return {};
     }
 
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ArrowFunction
src/lib/dnd/adapter.ts:32:37
     if (col.id === activeColumn.id) {
       return {
         ...col,
-        taskIds: col.taskIds.filter((id) => id !== activeId),
+        taskIds: col.taskIds.filter(() => undefined),
       };
     }
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] MethodExpression
src/lib/dnd/adapter.ts:32:18
     if (col.id === activeColumn.id) {
       return {
         ...col,
-        taskIds: col.taskIds.filter((id) => id !== activeId),
+        taskIds: col.taskIds,
       };
     }
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] BlockStatement
src/lib/dnd/adapter.ts:36:35
       };
     }
 
-    if (col.id === overColumn.id) {
-      const newTaskIds = [...col.taskIds];
-      const insertIndex = overIndex >= 0 ? overIndex : newTaskIds.length;
-      newTaskIds.splice(insertIndex, 0, activeId);
-      return {
-        ...col,
-        taskIds: newTaskIds,
-      };
-    }
+    if (col.id === overColumn.id) {}
 
     return col;
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] EqualityOperator
src/lib/dnd/adapter.ts:36:9
       };
     }
 
-    if (col.id === overColumn.id) {
+    if (col.id !== overColumn.id) {
       const newTaskIds = [...col.taskIds];
       const insertIndex = overIndex >= 0 ? overIndex : newTaskIds.length;
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] EqualityOperator
src/lib/dnd/adapter.ts:38:27
 
     if (col.id === overColumn.id) {
       const newTaskIds = [...col.taskIds];
-      const insertIndex = overIndex >= 0 ? overIndex : newTaskIds.length;
+      const insertIndex = overIndex > 0 ? overIndex : newTaskIds.length;
       newTaskIds.splice(insertIndex, 0, activeId);
       return {
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] ConditionalExpression
src/lib/dnd/adapter.ts:38:27
 
     if (col.id === overColumn.id) {
       const newTaskIds = [...col.taskIds];
-      const insertIndex = overIndex >= 0 ? overIndex : newTaskIds.length;
+      const insertIndex = false ? overIndex : newTaskIds.length;
       newTaskIds.splice(insertIndex, 0, activeId);
       return {
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc
