[Killed] BlockStatement
src/utils/localStorage.ts:3:56
 import { BoardState } from '../types';
 
-export const loadBoardState = (): BoardState | null => {
-  try {
-    const data = localStorage.getItem('boardState');
-    return data ? JSON.parse(data) : null;
-  } catch (err) {
-    console.error('Failed to load board state from localStorage', err);
-    return null;
-  }
-};
+export const loadBoardState = (): BoardState | null => {};
 
 export const saveBoardState = (state: BoardState): void => {
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] BlockStatement
src/utils/localStorage.ts:4:7
 import { BoardState } from '../types';
 
 export const loadBoardState = (): BoardState | null => {
-  try {
-    const data = localStorage.getItem('boardState');
-    return data ? JSON.parse(data) : null;
-  } catch (err) {
+  try {} catch (err) {
     console.error('Failed to load board state from localStorage', err);
     return null;
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] BlockStatement
src/utils/localStorage.ts:7:17
   try {
     const data = localStorage.getItem('boardState');
     return data ? JSON.parse(data) : null;
-  } catch (err) {
-    console.error('Failed to load board state from localStorage', err);
-    return null;
-  }
+  } catch (err) {}
 };
 
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Survived] StringLiteral
src/utils/localStorage.ts:8:19
     const data = localStorage.getItem('boardState');
     return data ? JSON.parse(data) : null;
   } catch (err) {
-    console.error('Failed to load board state from localStorage', err);
+    console.error("", err);
     return null;
   }

[Killed] BlockStatement
src/utils/localStorage.ts:13:60
   }
 };
 
-export const saveBoardState = (state: BoardState): void => {
-  try {
-    localStorage.setItem('boardState', JSON.stringify(state));
-  } catch (err) {
-    console.error('Failed to save board state to localStorage', err);
-  }
-};
+export const saveBoardState = (state: BoardState): void => {};
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] BlockStatement
src/utils/localStorage.ts:14:7
 };
 
 export const saveBoardState = (state: BoardState): void => {
-  try {
-    localStorage.setItem('boardState', JSON.stringify(state));
-  } catch (err) {
+  try {} catch (err) {
     console.error('Failed to save board state to localStorage', err);
   }
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Killed] BlockStatement
src/utils/localStorage.ts:16:17
 export const saveBoardState = (state: BoardState): void => {
   try {
     localStorage.setItem('boardState', JSON.stringify(state));
-  } catch (err) {
-    console.error('Failed to save board state to localStorage', err);
-  }
+  } catch (err) {}
 };
killedBy: All tests
statusReason: > task-board6@0.1.0 test:unit
> vitest --run src --run




 RUN  v0.34.6 C:/Users/nurbilgeozcan/Desktop/NurBilgeOZCAN/module6/Task-Board6/.stryker-tmp/sandbox-wCDLnc

[Survived] StringLiteral
src/utils/localStorage.ts:17:19
   try {
     localStorage.setItem('boardState', JSON.stringify(state));
   } catch (err) {
-    console.error('Failed to save board state to localStorage', err);
+    console.error("", err);
   }
 };
